class Translation(object):
    START_TEXT = """❖￤مرحبا بك  في بوت تعديل أسماء الملفات 
<b>❖￤يرجى ارسال اي ملف تريد تعديل اسمه وثم الرد عليه بالامر التالي :
/rename اسم الملف </b>
❖￤استخدم الامر /help للتفاصيل...."""
    RENAME_403_ERR = "المعذرة انت غير مسموح لك بتعديل اسم هذا الملف."
    ABS_TEXT = " رجاء لا تكون اناني "
    UPGRADE_TEXT = "<b>👉 اصنع بوتك الخاص هنا.. </b>  /help للتفاصيل"
    DOWNLOAD_START = "جاري التحميل"
    UPLOAD_START = "جاري الرفع"
    RCHD_TG_API_LIMIT = "تم التحميل في  {} ثانيه.\حجم الملف : {}\nالمعذرة أنا لا أستطيع تحميل الملفات أكبر من  1.5GB بسبب قيود تلقرام ."
    AFTER_SUCCESSFUL_UPLOAD_MSG = "**شكرا لاستخدامي🤓.**"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "تم التحميل في  {} ثواني.\تم الرفع في {} ثواني."
    NOT_AUTH_USER_TEXT = "الرجاء /upgrade اشتراكك."
    NOT_AUTH_USER_TEXT_FILE_SIZE = "تحديد حجم الملف: {}. المستخدمين المجانيين يستطيعوا تحميل فقط : {}\الرجاء  /upgrade اشتراكك.\اذا ترغب في الاشتراك راسلنا  <a href='https://telegram.me/haidarkrar'>فتى غولة عجيب</a>"
    SAVED_CUSTOM_THUMB_NAIL = "تم حفظ الصوره كصوره المعاينه للملف. هذه الصوره سوف تظهر على الملف."
    DEL_ETED_CUSTOM_THUMB_NAIL = "✅ تم حذف صورة المعاينه بنجاح .."
    FF_MPEG_DEL_ETED_CUSTOM_MEDIA = "✅ تم حذف ملف الوسائط..بنجاح."
    SAVED_RECVD_DOC_FILE = "تم تحميل الملف بنجاح."
    CUSTOM_CAPTION_UL_FILE = " "
    NO_CUSTOM_THUMB_NAIL_FOUND = "لا توجد صورة معاينه محفوظه."
    USER_ADDED_TO_DB = "المستخدم <a href='tg://user?id={}'>{}</a> اضيف الى  {} حتى {}."
    HELP_USER = """مرحبا انا بوت تعديل اسماء الملفات .
    
1. ارسل لي اي ملف الى هنا.
2. رد على الملف الي رسلته بالامر التالي /rename اسم الملف .
   
<b>👉 اصنع بوتك الخاص هنا:</b> 👉 <a href="https://t.me/haidarkrar">فتى غولة عجيب</a>

--------

قناتنا : @zwamlallaith
© مطور البوت @haidarkrar"""
    REPLY_TO_DOC_FOR_RENAME_FILE = "رد على الملف الذي تريد اعادة تسميته بالامر :
 `/rename اسم الملف`.."
    ABUSIVE_USERS = "انت غير مسموح لك باستخدام هذا البوت 
اذا تعتقد ان هذا خطأ اضغط /check لالغاء التقييد عليك ."
    FREE_USER_LIMIT_Q_SZE = """لا استطيع العمل .
المستخدمين المجانيين يستطيعوا تعديل اي ملف كل ٣٠ دقيقه 
اشترك  /upgrade او حاول بعد نص ساعه."""
    IFLONG_FILE_NAME = """الحد الاقصى لاسم الملف من تلقرام  {alimit} حرف فقط.
الملف الحالي يحتوي على  {num} حرف.

<b>غير مسموح بهذا الاسم في قوانين تلقرام!</b>
©️ <code>@haidarkrar</code>
الرجاء تقليل عدد الحروف للملف"""
